app/Controllers/Mahasiswa.php

    public function index()
    {
        $data['mahasiswa'] = $this->mahasiswa->getMahasiswa()->getResult();
---
SELECT *
FROM `mahasiswa`