app/Models/MahasiswaModel.php

    public function getMahasiswa()
    {
        $query =  $this->db->table('mahasiswa')
            ->select("mahasiswa.*,kelas.nama as nama_kelas,prodi.nama as nama_prodi")
            ->join('kelas', 'kelas.id = mahasiswa.id_kelas')
            ->join('prodi', 'prodi.id = mahasiswa.id_prodi')
            ->get();
---
SELECT `mahasiswa`.*, `kelas`.`nama` as `nama_kelas`, `prodi`.`nama` as `nama_prodi`
FROM `mahasiswa`
JOIN `kelas` ON `kelas`.`id` = `mahasiswa`.`id_kelas`
JOIN `prodi` ON `prodi`.`id` = `mahasiswa`.`id_prodi`

    public function createMahasiswa($data)
    {
        $query = $this->db->table('mahasiswa')
            ->insert($data);
---
INSERT INTO `mahasiswa` (`nama`, `nim`, `ipk`, `gender`, `id_kelas`, `id_prodi`, `tmp_lahir`, `tgl_lahir`) VALUES ('Nelan', '0110221189', '3.5', 'L', '1', '1', 'Bogor', '2001-07-25')

    public function deleteMahasiswa($id)
    {
        $query = $this->db->table('mahasiswa')
            ->where('id', $id)
            ->delete();
---
DELETE FROM `mahasiswa`
WHERE `id` = '12'

    public function getProdi()
    {
        $query = $this->db->table('prodi')
            ->get();
---
SELECT *
FROM `prodi`

    public function getKelas()
    {
        $query = $this->db->table('kelas')
            ->get();
---
SELECT *
FROM `kelas`